const ReplyList = require('../../classes/controllers/ReplyList');

const list = new ReplyList([
  (id) => `*Нассал <@${id}> в тапки*`,
  (id) => `*Наводит на <@${id}> порчу*`,
  (id) => `*Грызет ботинок <@${id}>*`,
  (id) => `*Шипит на <@${id}>*`,
  (id) => `*Рассыпает горох в постель <@${id}>*`,
  (id) => `*Подложил кнопку на стул <@${id}>*`,
  (id) => `*Пилит крепление люстры над <@${id}>*`,
  (id) => `*Подсыпает слабительное в стакан <@${id}>*`,
  (id) => `*Душит щупальцами куклу вуду <@${id}>*`,
  (id) => `*Пытаесться скастовать файербол в <@${id}>*`,
  (id) => `*Жалуется ктулху на <@${id}>*`,
  (id) => `*Чешется над тарелкой <@${id}>*`,
  (id) => `*Двусмысленно угрожает щупальцами <@${id}>*`,
  (id) => `*Громко мяучит на ухо <@${id}>*`,
]);

module.exports = (data) => {
  if (!data.users.length) throw new Error();

  const taboo = ['348195205943656459', '491192557167050752'];

  return data.users
    .map((user) => list.reply(taboo.includes(user) ? data.author : user))
    .join('\n');
};
